Revit 2024 API
VertexStreamPositionColored.AddVertex Method
 Inserts a VertexStreamPositionColored into the stream and associated buffer.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public void AddVertex(
	VertexPositionColored vertex
)
Visual Basic
Public Sub AddVertex ( _
	vertex As VertexPositionColored _
)
Visual C++
public:
void AddVertex(
	VertexPositionColored^ vertex
)
Parameters
vertex
Type: Autodesk.Revit.DB.DirectContext3D.VertexPositionColored
 The vertex to be inserted.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown if the associated buffer is not mapped. -or- Thrown if the associated buffer has insufficient space.
See Also
VertexStreamPositionColored Class
Autodesk.Revit.DB.DirectContext3D Namespace